[
	{
		"id": 332335,
		"date": "Sat Jan 01 2022",
		"topic": " OUR GOD IS A PROMISE KEEPER",
		"meditation": {
			"text": "For I am the LORD thy God, the Holy One of Israel, thy Saviour: I gave Egypt for thy ransom, Ethiopia and Seba for thee. Since thou wast precious in my sight, thou hast been honourable, and I have loved thee: therefore will I give men for thee, and people for thy life.",
			"reference": " (Isaiah 43:3-4)"
		},
		"text": {
			"title": "Today’s Text",
			"reference": " Isaiah 43:1-21",
			"text": ""
		},
		"body": "A human being may promise you and may not be able to keep it but it is not so with God. When God makes you a promise, He has all it takes to make it good. Has He promised to give you a child, a new job? He will do it. Whatever you are looking for, trust God and stop fretting. Trust His promises which He had made unto you. God does not lie, whatever He says He will do.",
		"prayer": [
			"Bless the Lord for He is dependable.",
			"Express your confidence in His promises."
		],
		"confession": [
			"Thank you Lord for your promises are sure. I hold on to your word because I know there will surely be a performance."
		],
		"further_study": [
			{
				"text": "Nevertheless my lovingkindness will I not utterly take from him, nor suffer my faithfulness to fail. 34 My covenant will I not break, nor alter the thing that is gone out of my lips.”",
				"reference": "Psalms 89:33-34:"
			},
			{
				"text": "Many are the afflictions of the righteous: but the LORD delivereth him out of them all. 20 He keepeth all his bones: not one of them is broken.”",
				"reference": "Psalms 34:19-20:"
			},
			{
				"text": "And God shall wipe away all tears from their eyes; and there shall be no more death, neither sorrow, nor crying, neither shall there be any more pain: for the former things are passed away.”",
				"reference": "Revelation 21:4:"
			}
		],
		"footer": " The 'Incubation' Daily Devotional is a bimonthly  publication  of Living Word Ministries Inc. "
	},
	{
		"id": 388626,
		"date": "Sun Jan 02 2022",
		"topic": " JOY AND PEACE GIVES LIFE TO THE BODY",
		"meditation": {
			"text": "Although the fig tree shall not blossom, neither shall fruit be in the vines; the labour of the olive shall fail, and the fields shall yield no meat; the flock shall be cut off from the fold, and there shall be no herd in the stalls: Yet I will rejoice in the LORD, I will joy in the God of my salvation..",
			"reference": " (Habakkuk 3:17-18)"
		},
		"text": {
			"title": "Today’s Text",
			"reference": " Habakkuk 3:16-19",
			"text": ""
		},
		"body": "What is troubling your heart? Why not settle it before the Lord and have peace? A peaceful heart gives life to the body. You look at us and you say, Are they not in this country? Are they not passing through what I am passing through? Haven’t they heard how costly things are right now? What should ever make them so happy?”Looking unto Jesus, the author and finisher of our faith. He is the one that gives us joy and happiness. The joy of the Lord is the medication you require right now. With the joy of the Lord, internal sickness will go: ulcer, high blood pressure, diabetes, etc, they will all go. ",
		"prayer": [
			"Pray that the Lord will give you a joyful heart even in the midst of circumstances.",
			"Ask God to give you opportunity to spread joy to others."
		],
		"confession": [
			"Lord, I want you to give me a merry heart at all times for it is good like medicine. I shall be a source of joy and happiness wherever I go, amen."
		],
		"further_study": [
			{
				"text": "These things I have spoken unto you, that in me ye might have peace. In the world ye shall have tribulation: but be of good cheer; I have overcome the world.",
				"reference": "John 16:33:"
			},
			{
				"text": "All the days of the afflicted are evil: but he that is of a merry heart hath a continual feast.”",
				"reference": "Proverbs 15:15:"
			},
			{
				"text": "Rejoice in the Lord alway: and again I say, Rejoice.”",
				"reference": " Philippians 4:4:"
			},
			{
				"text": "Because thy lovingkindness is better than life, my lips shall praise thee. 4 Thus will I bless thee while I live: I will lift up my hands in thy name.”",
				"reference": "Psalms 63:3-4:"
			},
			{
				"text": "Therefore with joy shall ye draw water out of the wells of salvation.”",
				"reference": "Isaiah 12:3:"
			}
		],
		"footer": " The 'Incubation' Daily Devotional is a bimonthly  publication  of Living Word Ministries Inc. "
	},
	{
		"id": 652224,
		"date": "Mon Jan 03 2022",
		"topic": " DO NOT COMPROMISE YOUR JOY AND PEACE",
		"meditation": {
			"text": "And let the peace of God rule in your hearts, to the which also ye are called in one body; and be ye thankful.",
			"reference": "(Colossians 3:15)"
		},
		"text": {
			"title": "Today’s Text",
			"reference": " Colossians 3:8-17",
			"text": ""
		},
		"body": "Make sure you have peace at all cost. The bible says to do whatever you can to be at peace with your fellow man and with God. Lack of joy kills, unhappiness kills. God said there shall be no peace for the wicked, are you the wicked? If you are not, why shouldn’t you have peace? Are you wondering how you would handle all these things coming around? Jesus is the way, truth and life. If God be for you, who can be against you? The great one of Israel is with you. Don’t be afraid, let God arise on your behalf and something will happen. Don’t panic; just say a word of prayer today and the problem will scatter, for the Lord goes ahead of you.",
		"prayer": [
			"Ask God to remove every spirit of anxiety, worry in your life.",
			"Ask God to help you to continually dwell on His word."
		],
		"confession": [
			"Lord Jesus, in you I have peace that passeth human understanding. I shall remain steadfast on your word and will not compromise my joy and peace, amen."
		],
		"further_study": [
			{
				"text": "A merry heart maketh a cheerful countenance: but by sorrow of the heart the spirit is broken.”",
				"reference": "Proverbs 15:13:"
			},
			{
				"text": "Better is little with the fear of the LORD than great treasure and trouble therewith. Better is a dinner of herbs where love is, than a stalled ox and hatred therewith.”",
				"reference": "Proverbs 15:16-17:"
			},
			{
				"text": "And the ransomed of the LORD shall return, and come to Zion with songs and everlasting joy upon their heads: they shall obtain joy and gladness, and sorrow and sighing shall flee away.”",
				"reference": "Isaiah 35:10:"
			}
		],
		"footer": " The 'Incubation' Daily Devotional is a bimonthly  publication  of Living Word Ministries Inc. "
	},
	{
		"id": 895958,
		"date": "Tue Jan 04 2022",
		"topic": " WINNING FAITH IS NOT DOUBLE MINDED",
		"meditation": {
			"text": "But let him ask in faith, nothing wavering. For he that wavereth is like a wave of the sea driven with the wind and tossed. For let not that man think that he shall receive any thing of the Lord. ",
			"reference": "(James 1:6-7)"
		},
		"text": {
			"title": "Today’s Text",
			"reference": " James 1:1-8",
			"text": ""
		},
		"body": "Faith is the means of transportation to the commonwealth of heaven. Use faith in everything you do as a child of God. Stop wavering like the sea, whenever the wind blows you go. When will you be steady? Have faith, believe God. Stop this dilly dallying, it is the reason why you are not receiving anything from God. You will get God’s attention when your mind is made. Do away with those negative thoughts, believe God for a miracle. Let people not find you as a double minded person, unable to take decision, unable to stand on issues, unable to resist the devil, a compromiser. ",
		"prayer": [
			"Pray for the grace to keep trusting God no matter the challenge."
		],
		"confession": [
			"Dear father, I put my trust in you, I remain resolute because I know you can never fail me."
		],
		"further_study": [
			{
				"text": "But without faith it is impossible to please him: for he that cometh to God must believe that he is, and that he is a rewarder of them that diligently seek him.”",
				"reference": "Hebrew 11:6:"
			},
			{
				"text": "Therefore, my beloved brethren, be ye stedfast, unmoveable, always abounding in the work of the Lord, forasmuch as ye know that your labour is not in vain in the Lord.”",
				"reference": "1 Corinthians 15:58:"
			},
			{
				"text": "For we are made partakers of Christ, if we hold the beginning of our confidence steadfast unto the end.”",
				"reference": "Hebrews 3:14:"
			}
		],
		"footer": " The 'Incubation' Daily Devotional is a bimonthly  publication  of Living Word Ministries Inc. "
	},
	{
		"id": 419841,
		"date": "Wed Jan 05 2022",
		"topic": " REACHING PEOPLE THROUGH THE EYE OF THEIR NEEDS",
		"meditation": {
			"text": "Jesus saith unto him, Rise, take up thy bed, and walk. And immediately the man was made whole, and took up his bed, and walked: and on the same day was the sabbath.",
			"reference": "(John 5:8-9)"
		},
		"text": {
			"title": "Today’s Text",
			"reference": " John 5:1-13",
			"text": ""
		},
		"body": "  If you claim to be a minister of God, whose life have you touched? If your ministry is not touching somebody in his area of need it is not a ministry. Many have lost the concept of ministering. Read the Bible, every minister was given to solution. What is your ministry doing in the life of people? What is your ministry doing in the church of Jesus Christ? That is the question you should ask yourself if you say God has called you into ministry. Ministry is about reaching people through the eye of their needs as God shows you needs all around, both physically and spiritually.",
		"prayer": [
			"Pray for the grace to detect and minister to the needs of people around you.",
			"Pray for the grace to be conscious of the call of God upon your life."
		],
		"confession": [
			"Dear father, I start with the needs of the people around me, I radiate your glory and preach Jesus through the eye of care."
		],
		"further_study": [
			{
				"text": "Howbeit Jesus suffered him not, but saith unto him, Go home to thy friends, and tell them how great things the Lord hath done for thee, and hath had compassion on thee. And he departed, and began to publish in Decapolis how great things Jesus had done for him: and all men did marvel.\"",
				"reference": "Mark 5:19-20:"
			},
			{
				"text": "And he said, About this season, according to the time of life, thou shalt embrace a son. And she said, Nay, my lord, thou man of God, do not lie unto thine handmaid. And the woman conceived, and bare a son at that season that Elisha had said unto her, according to the time of life.”",
				"reference": "2 Kings 4:16-17:"
			}
		],
		"footer": " The 'Incubation' Daily Devotional is a bimonthly  publication  of Living Word Ministries Inc. "
	},
	{
		"id": 81403,
		"date": "Thu Jan 06 2022",
		"topic": " OPEN THE EYES OF MY SPIRIT",
		"meditation": {
			"text": " And Elisha prayed, and said, LORD, I pray thee, open his eyes, that he may see. And the LORD opened the eyes of the young man; and he saw: and, behold, the mountain was full of horses and chariots of fire round about Elisha.",
			"reference": " (2 Kings 6:17)"
		},
		"text": {
			"title": "Today’s Text",
			"reference": " 2 Kings 6:1-23",
			"text": ""
		},
		"body": "We have two kinds of eyes, the one used in the physical realm and the other, used in the spirit realm. Here, the word of God is speaking about the eyes of the spirit being made open. There are many things the eyes of your spirit can solve for you if they are made open. But as long as you are spiritually blind, you will continue to have troubles, not knowing what to do. You will remain in fear when you only see with your physical eyes. ‘Open the eyes of my heart O Lord’ should be the prayer of every Christian; you cannot go far in life if the eyes of your heart are blind. ",
		"prayer": ["Pray that the Lord will open your spiritual eyes today.", "."],
		"confession": [
			"Thank you Lord for you are the revealer of deep things, open my spiritual eyes to see today, the way you see."
		],
		"further_study": [
			{
				"text": "Open thou mine eyes, that I may behold wondrous things out of thy law.”",
				"reference": "Psalm 119:18:"
			},
			{
				"text": "And their eyes were opened, and they knew him; and he vanished out of their sight.”",
				"reference": "Luke 24:31:"
			},
			{
				"text": "And it came to pass, when Joshua was by Jericho, that he lifted up his eyes and looked, and, behold, there stood a man over against him with his sword drawn in his hand: and Joshua went unto him, and said unto him, Art thou for us, or for our adversaries? And he said, Nay; but as captain of the host of the LORD am I now come. And Joshua fell on his face to the earth, and did worship, and said unto him, what saith my lord unto his servant?”",
				"reference": "Joshua 5:13-14:"
			}
		],
		"footer": " The 'Incubation' Daily Devotional is a bimonthly  publication  of Living Word Ministries Inc. "
	},
	{
		"id": 644877,
		"date": "Fri Jan 07 2022",
		"topic": " OUR GOD IS DEPENDABLE",
		"meditation": {
			"text": " Blessed be the LORD, that hath given rest unto his people Israel, according to all that he promised: there hath not failed one word of all his good promise, which he promised by the hand of Moses his servant.",
			"reference": " (1Kings 8:56)"
		},
		"text": {
			"title": "Today’s Text",
			"reference": " 1Kings 8:54-61",
			"text": ""
		},
		"body": "God can be trusted to keep His promise, whatever the matter is, God can be trusted. The dead will arise, Jesus will fulfill every promise you have read in the bible, let not your heart be troubled. We live by the promises of God, the heavens and the earth are held in place by his promises. God has made many deep promises; the Holy Ghost will help you understand it. The promises of God are reliable, they are dependable. What are the promises of God over your life? What promises has He made for your promotion, prosperity, protection and preservation? He said ‘Concerning my words, command ye me,’ the promises of God are His bond. ",
		"prayer": [
			"Bless God for He is dependable, His words must surely be fulfilled in your life."
		],
		"confession": [
			"Oh Lord God you are dependable, I hold on to you and I am not put to shame."
		],
		"further_study": [
			{
				"text": "For I am the LORD: I will speak, and the word that I shall speak shall come to pass; it shall be no more prolonged: for in your days, O rebellious house, will I say the word, and will perform it, saith the Lord GOD.”",
				"reference": "Ezekiel 12:25:"
			},
			{
				"text": "And being fully persuaded that, what he had promised, he was able also to perform. And therefore it was imputed to him for righteousness.”",
				"reference": "Romans 4:21-22:"
			},
			{
				"text": "Day and night they go about it upon the walls thereof: mischief also and sorrow are in the midst of it. Wickedness is in the midst thereof: deceit and guile depart not from her streets.”",
				"reference": "Psalm 55:10-11:"
			}
		],
		"footer": " The 'Incubation' Daily Devotional is a bimonthly  publication  of Living Word Ministries Inc. "
	},
	{
		"id": 193266,
		"date": "Sat Jan 08 2022",
		"topic": " THE REALITY OF WHO YOU ARE",
		"meditation": {
			"text": " What? know ye not that your body is the temple of the Holy Ghost which is in you, which ye have of God, and ye are not your own? For ye are bought with a price: therefore glorify God in your body, and in your spirit, which are God's.",
			"reference": " (1 Corinthians 6:19-20)"
		},
		"text": {
			"title": "Today’s Text",
			"reference": " 1 Corinthians 6:1-20",
			"text": ""
		},
		"body": "Who are you child of God? You are a new creation, a brand new man. You are not the man you used to be. Your old actions and character are all passed away; all things have become new. You are now the temple of God, the maker of heaven and earth has found His domain inside of you. 1 Corinthians 3:16-17, Know ye not that ye are the temple of God, and that the Spirit of God dwelleth in you? 17 If any man defile the temple of God, him shall God destroy; for the temple of God is holy, which temple ye are.” What should bother each and every one of us now is Who does God say I am?” Don’t you know that you should keep yourself holy? Will you like to mess up where your heavenly father lives?",
		"prayer": [
			"Pray for a revelation of who you truly are in Christ Jesus.",
			"Pray that the reality of your status in Christ will always guide your heart and mind."
		],
		"confession": [
			"Lord God, may the revelation of who I truly am in Christ never depart from my gaze, may I live a life befitting my status in you all the days of my life."
		],
		"further_study": [
			{
				"text": "But ye are a chosen generation, a royal priesthood, an holy nation, a peculiar people; that ye should shew forth the praises of him who hath called you out of darkness into his marvellous light:",
				"reference": "1 Peter 2:9-10:"
			},
			{
				"text": "I am the vine, ye are the branches: He that abideth in me, and I in him, the same bringeth forth much fruit: for without me ye can do nothing.”",
				"reference": "John 15:5:"
			},
			{
				"text": "The Spirit itself beareth witness with our spirit, that we are the children of God: 17 And if children, then heirs; heirs of God, and joint-heirs with Christ; if so be that we suffer with him, that we may be also glorified together.”",
				"reference": "Romans 8:16-17:"
			}
		],
		"footer": " The 'Incubation' Daily Devotional is a bimonthly  publication  of Living Word Ministries Inc. "
	},
	{
		"id": 65481,
		"date": "Sun Jan 09 2022",
		"topic": " SEEK GOD AND YIELD YOURSELF",
		"meditation": {
			"text": "But Jesus withdrew himself with his disciples to the sea: and a great multitude from Galilee followed him, and from Judaea, And from Jerusalem, and from Idumaea, and from beyond Jordan; and they about Tyre and Sidon, a great multitude, when they had heard what great things he did, came unto him.",
			"reference": "(Mark 3:7-8)"
		},
		"text": {
			"title": "Today’s Text",
			"reference": " Mark 3:7-12",
			"text": ""
		},
		"body": "These people were hungry for spiritual life, for salvation and for miracle. He that has Christ has life. Anywhere Jesus is planted people go there. Jesus the light attracted whatever it is that needed light. Jesus asked His disciples to get Him a boat before the people crush Him. That was how much the people sought Jesus. When you are plastic, uninterested or lethargic, it would be difficult for you to get your miracle. If you know what you are going to get you will put your spirit there to receive from Jesus. Jesus is more important than your schedule with anybody, no matter how highly placed. Except you seek Him and seek Him in this manner, your prayer may not be answered. Pay the price; let the fire come into your heart so that you will be sincere in the pursuit of God.",
		"prayer": [
			"Pray for a hundred to seek God.",
			"Ask that the Lord will help you to be steadfast in seeking after Him."
		],
		"confession": [
			"Thank you, Lord for the ultimate price which you paid for me. I consecrate myself to you, serving you with whole-hearted devotion."
		],
		"further_study": [
			{
				"text": "Blessed are they which do hunger and thirst after righteousness: for they shall be filled.”",
				"reference": "Matthew 5:6:"
			},
			{
				"text": "In the last day, that great day of the feast, Jesus stood and cried, saying, If any man thirst, let him come unto me, and drink.”",
				"reference": "John 7:37:"
			},
			{
				"text": "Seek the LORD and his strength, seek his face continually.”",
				"reference": "1 Chronicle 16:11:"
			}
		],
		"footer": " The 'Incubation' Daily Devotional is a bimonthly  publication  of Living Word Ministries Inc."
	},
	{
		"id": 646381,
		"date": "Mon Jan 10 2022",
		"topic": " CAST OUT THE DEVIL",
		"meditation": {
			"text": "And the seventy returned again with joy, saying, Lord, even the devils are subject unto us through thy name.",
			"reference": " (Luke 10:17)"
		},
		"text": {
			"title": "Today’s Text",
			"reference": " Luke 10:17-20",
			"text": ""
		},
		"body": "Jesus Christ went down to hell and bound Satan, He stripped him of all his powers and handed you the victory. Everyone that believes in Jesus has power to cast out devils, all you need to do is to use the name of Jesus. The first authority Jesus gave to the disciples was to cast out devils. He said, Go in my name and cast out devils.” Why is Satan mesmerizing you despite the authority and power God has given to you, why should you be afraid of what is under you?",
		"prayer": [
			"Command that situation right now in the name of Jesus and receive your miracle."
		],
		"confession": [
			"I apply the name of Jesus over every challenges in my life. Whatever trials and tribulations I am facing are just names which is under one greater name – Jesus Christ."
		],
		"further_study": [
			{
				"text": "And this did she many days. But Paul, being grieved, turned and said to the spirit, I command thee in the name of Jesus Christ to come out of her. And he came out the same hour.”",
				"reference": "Acts 16:18:"
			},
			{
				"text": "Heal the sick, cleanse the lepers, raise the dead, cast out devils: freely ye have received, freely give.”",
				"reference": "Matthew 10:8:"
			},
			{
				"text": "They shall take up serpents; and if they drink any deadly thing, it shall not hurt them; they shall lay hands on the sick, and they shall recover.”",
				"reference": "Mark 16:18:"
			}
		],
		"footer": " The 'Incubation' Daily Devotional is a bimonthly  publication  of Living Word Ministries Inc."
	},
	{
		"id": 805731,
		"date": "Tue Jan 11 2022",
		"topic": " USE THE NAME OF JESUS",
		"meditation": {
			"text": "Be it known unto you all, and to all the people of Israel, that by the name of Jesus Christ of Nazareth, whom ye crucified, whom God raised from the dead, even by him doth this man stand here before you whole.",
			"reference": " (Acts 4:10)"
		},
		"text": {
			"title": "Today’s Text",
			"reference": " Acts 4:8-12",
			"text": ""
		},
		"body": "The devil is not more powerful than you. The name of Jesus is bigger than whatever challenge you are faced with. Through the name of Jesus impossibilities are made possible, This is the power of Christianity. What is your value for the name of Jesus? Rebuke the devil and he will flee from you. Say what you want, and you shall have it. Go ahead and create things. That is the mark of God, upon those who believe in the Lord Jesus Christ. The mark of a Christian and a believer.",
		"prayer": [
			"Ask God for anything right now in the name of Jesus.",
			"Speak to those things that are not ordained in your life and they will bow in the name of Jesus."
		],
		"confession": [
			"I am born of God, I have the life of God in me; Greater is he that is in me than is in the world."
		],
		"further_study": [
			{
				"text": "Then he called his twelve disciples together, and gave them power and authority over all devils, and to cure diseases. 2 And he sent them to preach the kingdom of God, and to heal the sick.”",
				"reference": "Luke 9:1-2:"
			},
			{
				"text": "And God wrought special miracles by the hands of Paul: 12 So that from his body were brought unto the sick handkerchiefs or aprons, and the diseases departed from them, and the evil spirits went out of them.”",
				"reference": "Acts 19:11-12:"
			},
			{
				"text": "And his name through faith in his name hath made this man strong, whom ye see and know: yea, the faith which is by him hath given him this perfect soundness in the presence of you all.”",
				"reference": "Acts 3:16:"
			}
		],
		"footer": " The 'Incubation' Daily Devotional is a bimonthly  publication  of Living Word Ministries Inc. "
	},
	{
		"id": 779680,
		"date": "Wed Jan 12 2022",
		"topic": " GOD, OUR HELPER",
		"meditation": {
			"text": " Give us help from trouble: for vain is the help of man. Through God we shall do valiantly: for he it is that shall tread down our enemies.",
			"reference": " (Psalms 60:11-12)"
		},
		"text": {
			"title": "Today’s Text",
			"reference": " Psalms 60:1-12",
			"text": ""
		},
		"body": "  If God does not help you, no man can. God is the helper of those who seek Him, He will neither leave nor forsake them. We say the Lord’s Prayer, which clearly points us to God as our helper. As a father, God takes delight in helping His children to the limit of His capability. The good news is that the capability of our God has no limit. Forget about your enemies, concentrate on God. Look unto Him, through the creator of the universe there must be a way. Psalms 3:5-6 I laid me down and slept; I awaked; for the LORD sustained me. 6 I will not be afraid of ten thousands of people, that have set themselves against me round about.” ",
		"prayer": [
			"Ask the Lord to help you over those areas you struggle with.",
			"Ask God to help you to keep your eyes on him and not depend on yourself all the time."
		],
		"confession": [
			"The Lord is my helper and my protection. In him, my heart has hoped and I have been helped."
		],
		"further_study": [
			{
				"text": "I will lift up mine eyes unto the hills, from whence cometh my help.”",
				"reference": "Psalms 121:1:"
			},
			{
				"text": "Fear thou not; for I am with thee: be not dismayed; for I am thy God: I will strengthen thee; yea, I will help thee; yea, I will uphold thee with the right hand of my righteousness.”",
				"reference": "Isaiah 41:10:"
			},
			{
				"text": "The LORD is my shepherd; I shall not want.”",
				"reference": "Psalm 23:1:"
			}
		],
		"footer": " The 'Incubation' Daily Devotional is a bimonthly  publication  of Living Word Ministries Inc. "
	},
	{
		"id": 30928,
		"date": "Thu Jan 13 2022",
		"topic": " PUT YOUR CONFIDENCE IN GOD",
		"meditation": {
			"text": "So that we may boldly say, The Lord is my helper, and I will not fear what man shall do unto me.",
			"reference": "(Hebrews 13:6)"
		},
		"text": {
			"title": "Today’s Text",
			"reference": " Hebrews 13:5-7",
			"text": ""
		},
		"body": "The arm of flesh will fail us, but God cannot fail us. That is the promise and confidence we have. Be strong, don’t be afraid. Whatever news you hear, God is more than able to handle it. Psalms 118:9 It is better to trust in the LORD than to put confidence in princes.” Man is temporal, man is today, tomorrow is no more he is limited, but God is unlimited. He has no tenure in His office, he is from everlasting to everlasting, God does not expire but man expires. Put your trust in the Lord, do not put confidence in man. Your connections will fail you but God will not fail you. Do you know God? ",
		"prayer": [
			"Ask the Lord to help you walk in His ways and put your trust in Him."
		],
		"confession": [
			"Father in heaven, you are all powerful. I believe that I can do all things through you,"
		],
		"further_study": [
			{
				"text": "Cast not away therefore your confidence, which hath great recompense of reward.”",
				"reference": "Hebrews 10:35:"
			},
			{
				"text": "They that trust in the LORD shall be as mount Zion, which cannot be removed, but abideth for ever.”",
				"reference": "Psalm 125:1:"
			},
			{
				"text": "Except the LORD build the house, they labour in vain that build it: except the LORD keep the city, the watchman waketh but in vain.”",
				"reference": "Psalm 127:1:"
			}
		],
		"footer": " The 'Incubation' Daily Devotional is a bimonthly  publication  of Living Word Ministries Inc. "
	},
	{
		"id": 550006,
		"date": "Fri Jan 14 2022",
		"topic": " I AM BLESSED",
		"meditation": {
			"text": "Speak unto Aaron and unto his sons, saying, On this wise ye shall bless the children of Israel, saying unto them, The LORD bless thee, and keep thee:",
			"reference": "(Numbers 6:23-24)"
		},
		"text": {
			"title": "Today’s Text",
			"reference": " Numbers 6:22-27",
			"text": ""
		},
		"body": "Over 38 years ago when my wife delivered my wonderful daughter, Amblessed, I was expecting a male child but behold she was female. The spirit of the average African caught up with me even as a man of God. When my wife asked me if I had a name for the child, I said no and drove off from the hospital. But before I could hit the road, the spirit of God struck me, You foolish man, don’t you know you are blessed? Get back and tell your wife that the name of your daughter is Amblessed?”I went back and told my wife her name and we laid hands on her and prayed. Can you imagine what a wonderful blessing she is today? I am blessed indeed. ",
		"prayer": ["Ask God for His blessings upon your life."],
		"confession": [
			"Despite what the enemy may be presenting before the eye of the flesh, I know I am blessed and I bask in the reality of God’s divine blessing all around me."
		],
		"further_study": [
			{
				"text": "Blessed be the God and Father of our Lord Jesus Christ, who hath blessed us with all spiritual blessings in heavenly places in Christ.”",
				"reference": "Ephesians 1:3:"
			},
			{
				"text": "Behold, I have received commandment to bless: and he hath blessed; and I cannot reverse it.”",
				"reference": "Numbers 23:20:"
			},
			{
				"text": "Blessed shall be the fruit of thy body, and the fruit of thy ground, and the fruit of thy cattle, the increase of thy kine, and the flocks of thy sheep. Blessed shall be thy basket and thy store.”",
				"reference": " Deuteronomy 28:4-5:"
			}
		],
		"footer": " The 'Incubation' Daily Devotional is a bimonthly  publication  of Living Word Ministries Inc. "
	},
	{
		"id": 261796,
		"date": "Sat Jan 15 2022",
		"topic": " SEE GOD IN THAT SITUATION",
		"meditation": {
			"text": "And Caleb stilled the people before Moses, and said, Let us go up at once, and possess it; for we are well able to overcome it.",
			"reference": "(Numbers 13:30)"
		},
		"text": {
			"title": "Today’s Text",
			"reference": " Numbers 13:17-33",
			"text": ""
		},
		"body": "  It is important that you see God in your life and not circumstances. Most times we are prone to see difficulties and not God, We gaze at it even while praying to God, consumed and absorbed by the challenges of life. Before you know it, the problem has become an idol which you worship. The secret of miracle is to look away from that challenge. Looking unto Jesus, the author and finisher of our faith. Gazing at his throne on daily basis, you absorb and assimilate His glory. You cannot win that battle if you are not continually looking on God. ",
		"prayer": [
			"Pray for the grace not to look at the challenge before you but upon God."
		],
		"confession": [
			"Father I look to you alone in my time of distress, I hold on to your promise for you are able to see me through."
		],
		"further_study": [
			{
				"text": "But we all, with open face beholding as in a glass the glory of the Lord, are changed into the same image from glory to glory, even as by the Spirit of the Lord.”",
				"reference": "2 Corinthians 3:18:"
			},
			{
				"text": "There hath no temptation taken you but such as is common to man: but God is faithful, who will not suffer you to be tempted above that ye are able; but will with the temptation also make a way to escape, that ye may be able to bear it.”",
				"reference": "1 Corinthians 10:13:"
			},
			{
				"text": "The LORD is my shepherd; I shall not want.”",
				"reference": "Psalm 23:4:"
			}
		],
		"footer": " The 'Incubation' Daily Devotional is a bimonthly  publication  of Living Word Ministries Inc. "
	},
	{
		"id": 76370,
		"date": "Mon Jan 17 2022",
		"topic": " PEACE AND A MERRY HEART",
		"meditation": {
			"text": "Although the fig tree shall not blossom, neither shall fruit be in the vines; the labour of the olive shall fail, and the fields shall yield no meat; the flock shall be cut off from the fold, and there shall be no herd in the stalls: Yet I will rejoice in the LORD, I will joy in the God of my salvation..",
			"reference": " (Habakkuk 3:17-18)"
		},
		"text": {
			"title": "Today’s Text",
			"reference": " Habakkuk 3:16-19",
			"text": ""
		},
		"body": "Whenever the Lord Jesus Christ comes into a dangerous scene, He declares, Peace be still.” When the disciples were in danger on the sea, Jesus declared, Peace be still.” Peace is vital in our homes, businesses, in our land and the world at large. You switch on the television and all you see is catastrophe in every part of the country. In times like this, a sound mind is very important and essential to your health. There is nothing as wonderful and as important as the peace of God. It is more important than the food you eat or the money you have. If you don’t have peace in your soul, you have nothing. ",
		"prayer": [
			"Ask God to give you a merry heart.",
			"Pray that you will be refresh, so that you will reflect the joy of the Lord in your life and to others."
		],
		"confession": [
			"Lord, even when I face challenges, and I am in the midst of troubles, may I find a reason to smile and bless those around me with joy, amen."
		],
		"further_study": [
			{
				"text": "Happy is that people, that is in such a case: yea, happy is that people, whose God is the LORD.”",
				"reference": "Psalms 144:15:"
			},
			{
				"text": "A merry heart doeth good like a medicine: but a broken spirit drieth the bones.”",
				"reference": "Proverbs 17:22:"
			},
			{
				"text": "Rejoice in the Lord always: and again I say, Rejoice.”",
				"reference": "Philippians 4:4:"
			},
			{ "reference": "1 Thessalonians 5:16:" }
		],
		"footer": "Rejoice evermore.”"
	},
	{
		"id": 91181,
		"date": "Tue Jan 18 2022",
		"topic": " DESIRE THE MIRACLE-WORKING POWER",
		"meditation": {
			"text": "And Aaron stretched out his hand over the waters of Egypt; and the frogs came up, and covered the land of Egypt.",
			"reference": "(Exodus 8:6)"
		},
		"text": {
			"title": "Today’s Text",
			"reference": " Exodus 8:1-13",
			"text": ""
		},
		"body": "Moses and Aaron performed strange and unnatural acts to deliver the children of Israel. Aaron threw down a stick and it turned into a serpent, his serpent swallowed the serpents of Pharaoh’s magicians. Power above power! These miracles are beyond the human brain. When you have the gift of miracles, seemingly difficult situations cannot overtake you. Is anything proving impossible for you right now? Plug into the gift of working of miracles and it will be taken care of. Pray for a miracle over that situation, be sensitive in the spirit and do that which God has asked you to do. The supernatural power of God will descend. ",
		"prayer": [
			"Pray for the indwelling power of the Holy Ghost to work miracles."
		],
		"confession": [
			"Lord, I receive your power to do signs and wonders in the society and in my local church in Jesus’ name, amen."
		],
		"further_study": [
			{
				"text": "…but the desire of the righteous shall be granted.”",
				"reference": "Proverbs 10:24b"
			},
			{
				"text": "But earnestly desire the best gifts. And yet I show you a more excellent way.”",
				"reference": "1 Corinthians 12:31:"
			},
			{
				"text": "I can do all things through Christ who strengthens me.”",
				"reference": "Philippians 4:13:"
			}
		],
		"footer": " The 'Incubation' Daily Devotional is a bimonthly  publication  of Living Word Ministries Inc. "
	},
	{
		"id": 718884,
		"date": "Wed Jan 19 2022",
		"topic": " PEACE AND A MERRY HEART",
		"meditation": {
			"text": "Although the fig tree shall not blossom, neither shall fruit be in the vines; the labour of the olive shall fail, and the fields shall yield no meat; the flock shall be cut off from the fold, and there shall be no herd in the stalls: Yet I will rejoice in the LORD, I will joy in the God of my salvation..",
			"reference": " (Habakkuk 3:17-18)"
		},
		"text": {
			"title": "Today’s Text",
			"reference": " Habakkuk 3:16-19",
			"text": ""
		},
		"body": "Whenever the Lord Jesus Christ comes into a dangerous scene, He declares, Peace be still.” When the disciples were in danger on the sea, Jesus declared, Peace be still.” Peace is vital in our homes, businesses, in our land and the world at large. You switch on the television and all you see is catastrophe in every part of the country. In times like this, a sound mind is very important and essential to your health. There is nothing as wonderful and as important as the peace of God. It is more important than the food you eat or the money you have. If you don’t have peace in your soul, you have nothing. ",
		"prayer": [
			"Ask God to give you a merry heart.",
			"Pray that you will be refresh, so that you will reflect the joy of the Lord in your life and to others."
		],
		"confession": [
			"Lord, even when I face challenges, and I am in the midst of troubles, may I find a reason to smile and bless those around me with joy, amen."
		],
		"further_study": [
			{
				"text": "Happy is that people, that is in such a case: yea, happy is that people, whose God is the LORD.”",
				"reference": "Psalms 144:15:"
			},
			{
				"text": "A merry heart doeth good like a medicine: but a broken spirit drieth the bones.”",
				"reference": "Proverbs 17:22:"
			},
			{
				"text": "Rejoice in the Lord always: and again I say, Rejoice.”",
				"reference": "Philippians 4:4:"
			},
			{ "reference": "1 Thessalonians 5:16:" }
		],
		"footer": "Rejoice evermore.”"
	},
	{
		"id": 715164,
		"date": "Wed Jan 19 2022",
		"topic": " DESIRE THE MIRACLE-WORKING POWER",
		"meditation": {
			"text": "And Aaron stretched out his hand over the waters of Egypt; and the frogs came up, and covered the land of Egypt.",
			"reference": "(Exodus 8:6)"
		},
		"text": {
			"title": "Today’s Text",
			"reference": " Exodus 8:1-13",
			"text": ""
		},
		"body": "Moses and Aaron performed strange and unnatural acts to deliver the children of Israel. Aaron threw down a stick and it turned into a serpent, his serpent swallowed the serpents of Pharaoh’s magicians. Power above power! These miracles are beyond the human brain. When you have the gift of miracles, seemingly difficult situations cannot overtake you. Is anything proving impossible for you right now? Plug into the gift of working of miracles and it will be taken care of. Pray for a miracle over that situation, be sensitive in the spirit and do that which God has asked you to do. The supernatural power of God will descend. ",
		"prayer": [
			"Pray for the indwelling power of the Holy Ghost to work miracles."
		],
		"confession": [
			"Lord, I receive your power to do signs and wonders in the society and in my local church in Jesus’ name, amen."
		],
		"further_study": [
			{
				"text": "…but the desire of the righteous shall be granted.”",
				"reference": "Proverbs 10:24b"
			},
			{
				"text": "But earnestly desire the best gifts. And yet I show you a more excellent way.”",
				"reference": "1 Corinthians 12:31:"
			},
			{
				"text": "I can do all things through Christ who strengthens me.”",
				"reference": "Philippians 4:13:"
			}
		],
		"footer": " The 'Incubation' Daily Devotional is a bimonthly  publication  of Living Word Ministries Inc. "
	},
	{
		"id": 945362,
		"date": "Thu Jan 20 2022",
		"topic": " NAME ABOVE ALL NAMES",
		"meditation": {
			"text": " Nor is there salvation in any other, for there is no other name under heaven given among men by which we must be saved.",
			"reference": " (Acts 4:12)"
		},
		"text": {
			"title": "Today’s Text",
			"reference": " Acts 4:1-22",
			"text": ""
		},
		"body": "  Many times we are afraid of elemental spirits, oracle spirit and ocultic powers, when they are mentioned or when we are threatened in their names our hearts jump into our stomach. If you say you are a child of God, I don’t know how you magnify such names above the name of our Lord Jesus Christ. If you have a revelation and understanding of what the name Jesus Christ is, you will not be afraid of these spirits. The name of Jesus Christ is above every name in heaven, on earth and under the earth. He is above principalities and powers, above anything that exists.",
		"prayer": ["Decree the name of Jesus in that troubling situation."],
		"confession": [
			"O Lord, I confess with my mouth that your name works wonders, may it manifest right now in my life in Jesus’ name, amen."
		],
		"further_study": [
			{
				"text": "And these signs shall follow them that believe; In my name shall they cast out devils; they shall speak with new tongues; 18 They shall take up serpents; and if they drink any deadly thing, it shall not hurt them; they shall lay hands on the sick, and they shall recover.",
				"reference": "Mark 16:17-18:"
			},
			{
				"text": "And whatsoever ye shall ask in my name, that will I do, that the Father may be glorified in the Son.”",
				"reference": "John 14:13:"
			},
			{
				"text": "Therefore God also has highly exalted Him and given Him the name which is above every name,”",
				"reference": "Philippians 2:9:"
			},
			{ "reference": "Acts 3:16:" }
		],
		"footer": ""
	},
	{
		"id": 582596,
		"date": "Fri Jan 21 2022",
		"topic": " THE GIFTS OF HEALING",
		"meditation": {
			"text": " Surely he hath borne our griefs, and carried our sorrows: yet we did esteem him stricken, smitten of God, and afflicted. 5 But he was wounded for our transgressions, he was bruised for our iniquities: the chastisement of our peace was upon him; and with his stripes we are healed.",
			"reference": " (Isaiah 53:4-5)"
		},
		"text": {
			"title": "Today’s Text",
			"reference": " Isaiah 53:1-5",
			"text": ""
		},
		"body": "  It is a thing of joy to know that there are gifts of healing which defuse sicknesses and diseases. Sickness is the work of the devil which came as a result of sin. The purpose of the gifts of healing is to deliver the sick and destroy the works of the devil in the human body. The gifts of healing is not only to heal the sick, it also makes one immune to sicknesses. The gifts of healing is given by God for the supernatural healing of diseases without natural means from any source. Whatever the Lord gives in this dimension is supernatural. It does not mean that all other gifts of healing are not from God, but this is supernaturally operated. ",
		"prayer": [
			"Pray for the gift of healing.",
			"Ask God to restore strength to your body."
		],
		"confession": [
			"Thank you Lord for your healing power. I hold unto your word for I know that you can never fail."
		],
		"further_study": [
			{
				"text": "How God anointed Jesus of Nazareth with the Holy Ghost and with power: who went about doing good, and healing all that were oppressed of the devil; for God was with him.”",
				"reference": "Acts 10:38:"
			},
			{
				"text": "And they went forth, and preached every where, the Lord working with them, and confirming the word with signs following. Amen.”",
				"reference": "Mark 16:18:"
			},
			{
				"text": "To another faith by the same Spirit; to another the gifts of healing by the same Spirit;”",
				"reference": "1 Corinthians 12:9:"
			},
			{
				"text": "Then he called his twelve disciples together, and gave them power and authority over all devils, and to cure diseases. And he sent them to preach the kingdom of God, and to heal the sick.”",
				"reference": "Luke 9:1-2:"
			}
		],
		"footer": " The 'Incubation' Daily Devotional is a bimonthly  publication  of Living Word Ministries Inc. "
	},
	{
		"id": 566391,
		"date": "Sat Jan 22 2022",
		"topic": " TAKE ACTION THAT STIRS UP YOUR FAITH",
		"meditation": {
			"text": "He took up also the mantle of Elijah that fell from him, and went back, and stood by the bank of Jordan; And he took the mantle of Elijah that fell from him, and smote the waters, and said, Where is the LORD God of Elijah? And when he also had smitten the waters, they parted hither and thither: and Elisha went over.",
			"reference": " (2 Kings 2:13-14)"
		},
		"text": {
			"title": "Today’s Text",
			"reference": " 2 Kings 2:9-15",
			"text": ""
		},
		"body": "Anytime the children of Israel were faced with strong opposition they would remember the ark of God. What was the content of the ark? They were articles of miracles God worked for them in the past, like Aaron’s rod that budded. When you remember the works of God, his healing and miracle in your life, when you begin to count your blessings one after the other, whatever stands before you as a mountain of opposition becomes insignificant in your eyes. Learn to provoke the power of God in your life by recalling miracles of the past.",
		"prayer": [
			"Ask God to grant you a steadfast and consistent prayer life that will produce in you a great faith.",
			"Ask the Lord to empower you to take the steps of faith by acting on His promises despite the challenges."
		],
		"confession": [
			"Thank you, Lord, for the gift of faith. I desire to be strong that nothing the enemy sends my way will distract me from the promises of God."
		],
		"further_study": [
			{
				"text": "Thy servant slew both the lion and the bear: and this uncircumcised Philistine shall be as one of them, seeing he hath defied the armies of the living God.”",
				"reference": "1 Samuel 17:36:"
			},
			{
				"text": "For she said, If I may touch but his clothes, I shall be whole. And straightway the fountain of her blood was dried up; and she felt in her body that she was healed of that plague.”",
				"reference": "Mark 5:28-29:"
			},
			{
				"text": "As yet I am as strong this day as I was in the day that Moses sent me: as my strength was then, even so is my strength now, for war, both to go out, and to come in.",
				"reference": "Joshua 14:11-12:"
			}
		],
		"footer": ""
	},
	{
		"id": 42934,
		"date": "Sun Jan 23 2022",
		"topic": " LET YOUR TESTIMONIES GO TO WAR",
		"meditation": {
			"text": "David said moreover, The LORD that delivered me out of the paw of the lion, and out of the paw of the bear, he will deliver me out of the hand of this Philistine. And Saul said unto David, Go, and the LORD be with thee.",
			"reference": " (1 Samuel 17:37)"
		},
		"text": {
			"title": "Today’s Text",
			"reference": " 1 Samuel 17:34-38",
			"text": ""
		},
		"body": "Greater is He that is in you than He that is in the world. Bring the greater one to the forefront of your challenges today. The giants you see today you will see no more. Let your testimonies go to war. Can you remember the way God led you through and delivered you? God is a God of constant character, in Him there is no variableness neither is there a shadow of turning. Has he delivered you before? The same God that saw you through yesterday will see you through today and even tomorrow. Don’t be afraid of the enemy Don’t pray like one who is shadow-boxing, when you pray, do it with conviction. ",
		"prayer": [
			"Lay aside every weight with the testimony of what God has done in the past."
		],
		"confession": [
			"Father, I address every mountain before me with the testimony of God’s goodness to me in Jesus’ name, amen."
		],
		"further_study": [
			{
				"text": "I have been young, and now am old; yet have I not seen the righteous forsaken, nor his seed begging bread.”",
				"reference": "Psalm 37:25:"
			},
			{
				"text": "And as soon as we had heard these things, our hearts did melt, neither did there remain any more courage in any man, because of you: for the LORD your God, he is God in heaven above, and in earth beneath. Now therefore, I pray you, swear unto me by the LORD, since I have shewed you kindness, that ye will also shew kindness unto my father's house, and give me a true token:”",
				"reference": "Joshua 2:11-12:"
			},
			{
				"text": "Art not thou our God, who didst drive out the inhabitants of this land before thy people Israel, and gavest it to the seed of Abraham thy friend for ever?”",
				"reference": "2 Chronicles 20:7:"
			}
		],
		"footer": " The 'Incubation' Daily Devotional is a bimonthly  publication  of Living Word Ministries Inc. "
	},
	{
		"id": 716137,
		"date": "Mon Jan 24 2022",
		"topic": " PROSPERITY COMES FROM GOD",
		"meditation": {
			"text": "Then answered I them, and said unto them, The God of heaven, he will prosper us; therefore we his servants will arise and build: but ye have no portion, nor right, nor memorial, in Jerusalem.",
			"reference": "(Nehemiah 2:20)"
		},
		"text": {
			"title": "Today’s text",
			"reference": " Nehemiah 2:18-20",
			"text": ""
		},
		"body": "Prosperity comes from the Lord. No other person can prosper you except God. If the devil prospers you it does not last, it is full of worms. There is no disappointment in God, as long as God is with you, He will certainly prosper you. God has programmed His children to prosper; have a prosperity mindset, not a spirit of failure. Don’t look down on yourself, when you do, you are operating in doubt and your prayers can not go beyond the roof because you have already condemned yourself. Prosperity comes not from the East or West but from God. The God of heaven will prosper you. Are you embarking on any project? Register it in your heart that God will prosper you. ",
		"prayer": ["Pray for open heavens upon you."],
		"confession": [
			"Lord, I worry no more about my life. I depend solely on you for providence in Jesus’ name, amen."
		],
		"further_study": [
			{
				"text": "But my God shall supply all your need according to his riches in glory by Christ Jesus.”",
				"reference": "Philippians 4:19:"
			},
			{
				"text": "But seek ye first the kingdom of God, and his righteousness; and all these things shall be added unto you.”",
				"reference": "Matthew 6:33:"
			},
			{
				"text": "Then thou shalt see, and flow together, and thine heart shall fear, and be enlarged; because the abundance of the sea shall be converted unto thee, the forces of the Gentiles shall come unto thee.”",
				"reference": "Isaiah 60:5:"
			}
		],
		"footer": " The 'Incubation' Daily Devotional is a bimonthly  publication  of Living Word Ministries Inc. "
	},
	{
		"id": 676826,
		"date": "Tue Jan 25 2022",
		"topic": " GOD IS WHAT HE SAYS HE IS",
		"meditation": {
			"text": "And God said unto Moses, I AM THAT I AM: and he said, Thus shalt thou say unto the children of Israel, I AM hath sent me unto you.",
			"reference": " (Exodus 3:14)"
		},
		"text": {
			"title": "Today’s Text",
			"reference": " Exodus 3:1-15",
			"text": ""
		},
		"body": "  You can’t worship what you do not know. When you know who God is and who is speaking, it will enlarge your vision and relationship and give you confidence and faith. This is the key that triggers miracles. Moses asked, Who are you Lord?” You cannot witness about somebody you know nothing about. Upon the revelation of the person of God, Moses began to decode God in a practical and authentic way so he would know what he was talking about. Take some time to mediate on the approach of Moses towards God. God told Moses, I Am who I Am, I am all encompassing. I am omnipotent and omniscient.” ",
		"prayer": [
			"Ask that the Lord will forgive your unbelief and cause faith to arise in you by reason of His word.",
			"Table those challenges before the Lord and believe you have your miracles right now."
		],
		"confession": [
			"Precious father, thank you for you are the I Am, all I may ever need in life is available in you."
		],
		"further_study": [
			{
				"text": "Then came the word of the LORD unto Jeremiah, saying, 27 Behold, I am the LORD, the God of all flesh: is there any thing too hard for me?”",
				"reference": "Jeremiah 32:26-27:"
			},
			{
				"text": "Know ye that the LORD he is God: it is he that hath made us, and not we ourselves; we are his people, and the sheep of his pasture.”",
				"reference": "Psalms 100:3:"
			},
			{
				"text": "I will put none of these diseases upon thee, which I have brought upon the Egyptians: for I am the LORD that healeth thee.”",
				"reference": "Exodus 15:26b:"
			}
		],
		"footer": " The 'Incubation' Daily Devotional is a bimonthly  publication  of Living Word Ministries Inc. "
	},
	{
		"id": 28012,
		"date": "Wed Jan 26 2022",
		"topic": " GOD CAN DO WHAT HE SAYS HE CAN DO",
		"meditation": {
			"text": " Thus saith the LORD the King of Israel, and his redeemer the LORD of hosts; I am the first, and I am the last; and beside me there is no God. And who, as I, shall call, and shall declare it, and set it in order for me, since I appointed the ancient people? and the things that are coming, and shall come, let them shew unto them.",
			"reference": " (Isaiah 44:6-7)"
		},
		"text": {
			"title": "Today’s Text",
			"reference": " Isaiah 44:1-11",
			"text": ""
		},
		"body": "From the word of God you can tell who God is. His word gives insight into His personality, and in the process of meditating on Him, miracles occur. Every statement of who God is, is absolute; He says, Besides me there is none.” Do not live in fear; rather as you are exposed to the attributes of God, get your spirit into it. Whatever you command in the name of Jesus will come to pass. Let your heart be strong, we worship God the almighty. Let Him be magnified among the heathen. In times like this, the evidence of your meditation is important. Where do you centre your meditation? Don’t just kneel praying without the knowledge of the one before whom you are kneeling.",
		"prayer": [
			"Glorify God in that situation for He will do that which He has promised.",
			"Silence unbelief, fear and doubt in the name of Jesus."
		],
		"confession": [
			"Father I praise your name for you are all powerful, every challenge in my life bows to your supremacy in Jesus’ name."
		],
		"further_study": [
			{
				"text": "See now that I, even I, am he, and there is no god with me: I kill, and I make alive; I wound, and I heal: neither is there any that can deliver out of my hand.40 For I lift up my hand to heaven, and say, I live forever.”",
				"reference": "Deuteronomy 32:39-40:"
			},
			{
				"text": "He raiseth up the poor out of the dust, and lifteth the needy out of the dunghill; 8 That he may set him with princes, even with the princes of his people. 9 He maketh the barren woman to keep house, and to be a joyful mother of children. Praise ye the Lord.”",
				"reference": "Psalms 113:7-9:"
			},
			{
				"text": "God is not a man, that he should lie; neither the son of man, that he should repent: hath he said, and shall he not do it? Or hath he spoken, and shall he not make it good?”",
				"reference": "Numbers 23:19:"
			}
		],
		"footer": " The 'Incubation' Daily Devotional is a bimonthly  publication  of Living Word Ministries Inc. "
	},
	{
		"id": 200637,
		"date": "Thu Jan 27 2022",
		"topic": " CALL UPON GOD IN SPIRIT AND IN TRUTH",
		"meditation": {
			"text": "Remember, O LORD, thy tender mercies and thy lovingkindnesses; for they have been ever of old. Remember not the sins of my youth, nor my transgressions: according to thy mercy remember thou me for thy goodness' sake, O LORD. ",
			"reference": "(Psalms 25:6-7)"
		},
		"text": {
			"title": "Today’s Text",
			"reference": " Psalms 25:1-22",
			"text": ""
		},
		"body": "Each time I study the scriptures, more especially the prayers of David, I see his heart. I see how sincere and passionate his prayers were. The prayers of David are so pertinent and touching to the spirit. I treasure the language of the man of God. When you come to God with a passionate plea, whatever the situation may be, a broken and contrite heart our God will not overlook. If it is the transgressions of the past that Satan is holding unto to afflict you, The Lord will forgive and remember them no more. Our God is a healer and a deliverer, He turns situations around. ",
		"prayer": ["Call upon the Lord concerning that need right now."],
		"confession": [
			"Dear Lord, I come to you. I know you are more than able to deliver me, you answered David, answer me today."
		],
		"further_study": [
			{
				"text": "Hearken to me, ye that follow after righteousness, ye that seek the LORD: look unto the rock whence ye are hewn, and to the hole of the pit whence ye are digged. Look unto Abraham your father, and unto Sarah that bare you: for I called him alone, and blessed him, and increased him.”",
				"reference": "Isaiah 51:1-2:"
			},
			{
				"text": "O our God, wilt thou not judge them? for we have no might against this great company that cometh against us; neither know we what to do: but our eyes are upon thee. And all Judah stood before the LORD, with their little ones, their wives, and their children.”",
				"reference": "2 Chronicle 20:12-13:"
			},
			{
				"text": "In my distress I called upon the LORD, and cried unto my God: he heard my voice out of his temple, and my cry came before him, even into his ears.”",
				"reference": "Psalm 18:6:"
			}
		],
		"footer": " The 'Incubation' Daily Devotional is a bimonthly  publication  of Living Word Ministries Inc. "
	},
	{
		"id": 303371,
		"date": "Fri Jan 28 2022",
		"topic": " THE JUST SHALL LIVE BY FAITH",
		"meditation": {
			"text": " And being not weak in faith, he considered not his own body now dead, when he was about an hundred years old, neither yet the deadness of Sara's womb: He staggered not at the promise of God through unbelief; but was strong in faith, giving glory to God.",
			"reference": " (Romans 4:19-20)"
		},
		"text": {
			"title": "Today’s Text",
			"reference": " Romans 4:13-21",
			"text": ""
		},
		"body": "  There is no other way, no other principle which the Lord has provided for the just to live except by faith. On many occasions we find it difficult to live by faith, we are always living by sight because we have found ourselves in the physical realm. We make decisions based on our reasoning, thinking through things. Whatever we cannot find within the realm of reasoning, we throw aside. Often we are fretful, thinking the enemy has overrun us, we do not have the revelation of why God does whatever He does because it is not within the faculty of our five senses. Our God, in His supremacy, simply states, The just shall live by faith.” Whatever you are going through, let your approach be by faith.",
		"prayer": ["Pray that faith will arise in you to believe God completely."],
		"confession": [
			"Dear Lord, I believe you are more than able. I receive my miracle by faith in Jesus’ name."
		],
		"further_study": [
			{
				"text": "And she said, Truth, Lord: yet the dogs eat of the crumbs which fall from their masters' table. Then Jesus answered and said unto her, O woman, great is thy faith: be it unto thee even as thou wilt. And her daughter was made whole from that very hour.”",
				"reference": "Matthew 15:27-28:"
			},
			{
				"text": "But that no man is justified by the law in the sight of God, it is evident: for, The just shall live by faith.”",
				"reference": "Galatians 3:11:"
			},
			{
				"text": "But that no man is justified by the law in the sight of God, it is evident: for, The just shall live by faith.”",
				"reference": "Hebrews 11:8:"
			}
		],
		"footer": " The 'Incubation' Daily Devotional is a bimonthly  publication  of Living Word Ministries Inc. "
	},
	{
		"id": 427787,
		"date": "Sat Jan 29 2022",
		"topic": " DO NOT GIVE ROOM TO DISCOURAGEMENT",
		"meditation": {
			"text": "And when he heard that it was Jesus of Nazareth, he began to cry out, and say, Jesus, thou Son of David, have mercy on me. And many charged him that he should hold his peace: but he cried the more a great deal, Thou Son of David, have mercy on me. ",
			"reference": "(Mark 10:47-48)"
		},
		"text": {
			"title": "Today’s Text",
			"reference": " Mark 10:46-52",
			"text": ""
		},
		"body": "  Believing God is an everyday thing whether you receive the miracle immediately or not. One who believes God does not care about the circumstance or what the enemy is saying, he is lost, believing God. Stop considering that the sickness may kill you, let your heart stop going on the negative. Faith is not afraid of the facts; faith puts its trust in God.  ",
		"prayer": [
			"Silence every voice that may want to silence your faith in Jesus.",
			"Present your needs before God and believe for your miracle."
		],
		"confession": [
			"Father, I give no room to the devil. I believe you are able to meet my needs and I believe completely."
		],
		"further_study": [
			{
				"text": "And Caleb stilled the people before Moses, and said, Let us go up at once, and possess it; for we are well able to overcome it.”",
				"reference": "Numbers 13:30:"
			},
			{
				"text": "And David was greatly distressed; for the people spake of stoning him, because the soul of all the people was grieved, every man for his sons and for his daughters: but David encouraged himself in the LORD his God.”",
				"reference": "1 Samuel 30:6:"
			},
			{
				"text": "Although the fig tree shall not blossom, neither shall fruit be in the vines; the labour of the olive shall fail, and the fields shall yield no meat; the flock shall be cut off from the fold, and there shall be no herd in the stalls:”",
				"reference": "Habakkuk 3:17:"
			}
		],
		"footer": " The 'Incubation' Daily Devotional is a bimonthly  publication  of Living Word Ministries Inc. "
	},
	{
		"id": 396935,
		"date": "Sun Jan 30 2022",
		"topic": " GOD WILL NEVER DISAPPOINT YOU",
		"meditation": {
			"text": "For all the promises of God in him are yea, and in him Amen, unto the glory of God by us. ",
			"reference": "(2 Corinthians 1:20)"
		},
		"text": {
			"title": "Today’s Text",
			"reference": " 2 Corinthians 1:15-24",
			"text": ""
		},
		"body": "When God makes a promise to you His child, believe Him. God never fails. You cannot say you are disappointed in God because His promises are Yea and Amen. You must receive it by faith. God is not like men who make promises upon promises and never fulfill one. You can rely upon God’s promises. Whatever secret agreement or covenant you have entered with God, He will not disappoint you. Since I was young and now getting old, I have never seen the righteous forsaken nor his seed begging bread, that is what David said and it is exactly so. God will never disappoint you.",
		"prayer": [
			"Silence every spirit that brings up unnecessary debate at the promises of God over your life.",
			"Personalize a promise of God concerning that challenge and repeat it to yourself in prayer."
		],
		"confession": [
			"Dear Lord, thank you for you can never go back on your promise. I hold on to your word in faith in Jesus’ name."
		],
		"further_study": [
			{
				"text": "Whereby are given unto us exceeding great and precious promises: that by these ye might be partakers of the divine nature, having escaped the corruption that is in the world through lust.”",
				"reference": "2 Peter 1:4:"
			},
			{
				"text": "For verily I say unto you, Till heaven and earth pass, one jot or one tittle shall in no wise pass from the law, till all be fulfilled.”",
				"reference": "Matthew 5:18:"
			},
			{
				"text": "Can a woman forget her sucking child, that she should not have compassion on the son of her womb? yea, they may forget, yet will I not forget thee.”",
				"reference": "Isaiah 49:15:"
			}
		],
		"footer": " The 'Incubation' Daily Devotional is a bimonthly  publication  of Living Word Ministries Inc. "
	},
	{
		"id": 250450,
		"date": "Mon Jan 31 2022",
		"topic": " YOU ARE SAFE IN THE HOLLOW OF HIS HANDS",
		"meditation": {
			"text": "Then Satan answered the LORD, and said, Doth Job fear God for nought? Hast not thou made an hedge about him, and about his house, and about all that he hath on every side? thou hast blessed the work of his hands, and his substance is increased in the land.",
			"reference": "(Job 1:9-10)"
		},
		"text": {
			"title": "Today’s Text",
			"reference": " Job 1:8-11",
			"text": ""
		},
		"body": "The devil saw it and I don’t know why you don’t. Satan saw that Job and members of his household had an hedge round about them. Satan was invariably saying, I have power over those who don’t have an hedge around them but for those who have an hedge I am powerless.” Satan has a limit, the presence of God limits him, anointing breaks the yoke. The devil has no power over you. Let faith arise and let the enemies scatter. Job is not the only one with an hedge, that promise is for you also. The angels of the living God encampeth round about those who fear the Lord and delivereth them. That is the word of God, you cannot change it. Whatever God has written has been written. Those that put their trust in the Lord (in the hedge) shall not be put to shame or confounded. ",
		"prayer": [
			"Ask God to help you to live a life that is hidden in Christ alone which is your safety.",
			"Ask God to help you to center your thoughts on His word and not be moved by circumstances."
		],
		"confession": [
			"Lord, I thank you for your hedge round abound me. I will not fear whatever the devil may bring my way for I am safe in the hollow of your hands."
		],
		"further_study": [
			{
				"text": "The angel of the LORD encampeth round about them that fear him, and delivereth them.”",
				"reference": "Psalm 34:7:"
			},
			{
				"text": "For the eyes of the LORD run to and fro throughout the whole earth, to shew himself strong in the behalf of them whose heart is perfect toward him. Herein thou hast done foolishly: therefore from henceforth thou shalt have wars.”",
				"reference": "2 Chronicle 16:9:"
			}
		],
		"footer": " The 'Incubation' Daily Devotional is a bimonthly  publication  of Living Word Ministries Inc. "
	}
]
